# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep' 
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager

# Development
brew 'php'
brew 'php@8.0'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'node'
brew 'redis'
brew 'yarn'

# Terminal/display tools
brew 'exa'
brew 'romkatv/powerlevel10k/powerlevel10k'

# Apps
cask '1password'
cask '1password-cli'
cask 'anki'
cask 'arc'
cask 'backblaze'
cask 'bartender'
cask 'bettertouchtool'
cask 'chrome-remote-desktop-host'
cask 'cron'
cask 'discord'
cask 'github'
cask 'google-chrome'
cask 'grandperspective'
cask 'istat-menus'
cask 'obsidian'
cask 'openin'
cask 'path-finder'
cask 'raycast'
cask 'shottr'
cask 'slack'
cask 'steam'
cask 'superhuman'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tuple'
cask 'visual-studio-code'
cask 'warp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-fira-code-nerd-font'

# Mac App Store
mas 'Dato', id: 1470584107
mas 'Drafts', id: 1435957248
mas 'OpenIn', id: 1643649331
mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
